CSI API ETABS v1
cDesignSteel Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cDesignSteel
Public Interface cDesignSteel
Dim instance As cDesignSteel
public interface class cDesignSteel
type cDesignSteel =  interface end
The cDesignSteel type exposes the following members.
Properties
Name | Description
AISC_LRFD93
AISC360_05_IBC2006
AISC360_10
AISC360_16
AISC360_22
 AISC 360-22 steel design code.
Australian_AS4100_2020
Australian_AS4100_98
BS5950_2000
Canadian_S16_09
Canadian_S16_14
Canadian_S16_19
Canadian_S16_24
 CSA S16-24 steel design code.
Chinese_2010
Chinese_2018
EN1993_1_1_2005
Eurocode_3_2005
Indian_IS_800_2007
Italian_NTC_2008
Italian_NTC_2018
NewZealand_NZS3404_97
SP16_13330_2011
Top
Methods
Name | Description
DeleteResults
GetCode
 Retrieves the steel design code.
GetComboDeflection
GetComboStrength
GetDesignSection
GetGroup
GetResultsAvailable
 This function determines if the steel frame design results are available.
GetSummaryResults
GetSummaryResults_2
 DEPRECATED ; refer to GetSummaryResults_3(String, Int32, String[], eFrameDesignOrientation[], String[], String[], String[], Double[], Double[], Double[], Double[], String[], Double[], String[], Double[], eItemType)
GetSummaryResults_3
 Retrieves steel frame design summary results
GetTargetDispl
GetTargetPeriod
ResetOverwrites
SetAutoSelectNull
SetCode
 Sets the steel design code.
SetComboDeflection
SetComboStrength
SetDesignSection
SetGroup
SetTargetDispl
SetTargetPeriod
StartDesign
 Starts the steel frame design.
VerifyPassed
VerifySections
Top
See Also
Reference
ETABSv1 Namespace